
let _ = require('lodash');

let arr = [
  {
    'isFullAuth': true,
    'id': 810000000018,
    'name': 'RACP',
    'path': [
      {
        'children': [],
        'name': '浙江省',
        'id': 1001
      }
    ],
    'children': [
        {
            'children': [
                {
                    'goods': [
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780022',
                            'desc': '颈椎前路钢板 22.5mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000365
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780025',
                            'desc': '颈椎前路钢板 25.0mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000366
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780027',
                            'desc': '颈椎前路钢板 27.5mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000367
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780030',
                            'desc': '颈椎前路钢板 30.0mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000368
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780032',
                            'desc': '颈椎前路钢板 32.5mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000369
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780035',
                            'desc': '颈椎前路钢板 35.0mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000370
                        }
                    ],
                    'isFullAuth': true,
                    'path': [
                        {
                            'children': [],
                            'name': '浙江省',
                            'id': 1001
                        }
                    ],
                    'id': 810000000118,
                    'name': '单节段颈前路钢板'
                },
                {
                    'isFullAuth': true,
                    'goods': [
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780055',
                            'desc': '颈椎前路钢板 55.0mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000378
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780057',
                            'desc': '颈椎前路钢板 57.5mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000379
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780060',
                            'desc': '颈椎前路钢板 60.0mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000380
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780062',
                            'desc': '颈椎前路钢板 62.5mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000381
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780065',
                            'desc': '颈椎前路钢板 65.0mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000382
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780067',
                            'desc': '颈椎前路钢板 67.5mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000383
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780070',
                            'desc': '颈椎前路钢板 70.0mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000384
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780072',
                            'desc': '颈椎前路钢板 72.5mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000385
                        }
                    ],
                    'path': [
                        {
                            'children': [],
                            'name': '浙江省',
                            'id': 1001
                        }
                    ],
                    'id': 810000000119,
                    'name': '多节段颈前路钢板'
                },
                {
                    'isFullAuth': true,
                    'goods': [
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780037',
                            'desc': '颈椎前路钢板 37.5mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000371
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780040',
                            'desc': '颈椎前路钢板 40.0mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000372
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780042',
                            'desc': '颈椎前路钢板 42.5mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000373
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780045',
                            'desc': '颈椎前路钢板 45.0mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000374
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780047',
                            'desc': '颈椎前路钢板 47.5mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000375
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780050',
                            'desc': '颈椎前路钢板 50.0mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000376
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61780052',
                            'desc': '颈椎前路钢板 52.5mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎钛板',
                            'id': 810000000377
                        }
                    ],
                    'path': [
                        {
                            'children': [],
                            'name': '浙江省',
                            'id': 1001
                        }
                    ],
                    'id': 810000000120,
                    'name': '二节段颈前路钢板'
                }
            ],
            'isFullAuth': true,
            'path': [
                {
                    'children': [],
                    'name': '浙江省',
                    'id': 1001
                }
            ],
            'id': 810000000052,
            'name': '颈前路钢板'
        },
        {
            'children': [
                {
                    'goods': [
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61781413',
                            'desc': '自攻松质骨螺钉 4.0×13mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎螺钉',
                            'id': 810000000386
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61781415',
                            'desc': '自攻松质骨螺钉 4.0×15mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎螺钉',
                            'id': 810000000387
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61781417',
                            'desc': '自攻松质骨螺钉 4.0×17mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎螺钉',
                            'id': 810000000388
                        }
                    ],
                    'isFullAuth': true,
                    'path': [
                        {
                            'children': [],
                            'name': '浙江省',
                            'id': 1001
                        }
                    ],
                    'id': 810000000121,
                    'name': '自攻螺钉 4.0'
                },
                {
                    'isFullAuth': true,
                    'goods': [
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61781513',
                            'desc': '自攻松质骨螺钉 4.5×13mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎螺钉',
                            'id': 810000000389
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61781515',
                            'desc': '自攻松质骨螺钉 4.5×15mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎螺钉',
                            'id': 810000000390
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '61781517',
                            'desc': '自攻松质骨螺钉 4.5×17mm',
                            'name': '脊柱前路内固定系统 颈椎钉板 颈椎螺钉',
                            'id': 810000000391
                        },
                        {
                            'path': [
                                {
                                    'children': [],
                                    'name': '浙江省',
                                    'id': 1001
                                }
                            ],
                            'no': '999999999',
                            'desc': null,
                            'name': 'test',
                            'id': 811000011455
                        }
                    ],
                    'path': [
                        {
                            'children': [],
                            'name': '浙江省',
                            'id': 1001
                        }
                    ],
                    'id': 810000000122,
                    'name': '自攻螺钉 4.5'
                }
            ],
            'isFullAuth': true,
            'path': [
                {
                    'children': [],
                    'name': '浙江省',
                    'id': 1001
                }
            ],
            'id': 810000000053,
            'name': '螺钉'
        }
    ],
    'goods': []
  },
  {
      'isFullAuth': true,
      'id': 810000000019,
      'name': 'RCAGE',
      'path': [
          {
              'children': [],
              'name': '浙江省',
              'id': 1001
          }
      ],
      'children': [
          {
              'children': [
                  {
                      'goods': [
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '62310822',
                              'desc': '腰椎融合器 8×22mm',
                              'name': '脊柱内固定器 融合器',
                              'id': 810000000417
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '62310826',
                              'desc': '腰椎融合器 8×26mm',
                              'name': '脊柱内固定器 融合器',
                              'id': 810000000418
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '62310830',
                              'desc': '腰椎融合器 8×30mm',
                              'name': '脊柱内固定器 融合器',
                              'id': 810000000419
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '62310834',
                              'desc': '腰椎融合器 8×34mm',
                              'name': '脊柱内固定器 融合器',
                              'id': 810000000420
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '62311022',
                              'desc': '腰椎融合器 10×22mm',
                              'name': '脊柱内固定器 融合器',
                              'id': 810000000421
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '62311026',
                              'desc': '腰椎融合器 10×26mm',
                              'name': '脊柱内固定器 融合器',
                              'id': 810000000422
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '62311030',
                              'desc': '腰椎融合器 10×30mm',
                              'name': '脊柱内固定器 融合器',
                              'id': 810000000423
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '62311034',
                              'desc': '腰椎融合器 10×34mm',
                              'name': '脊柱内固定器 融合器',
                              'id': 810000000424
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '62311222',
                              'desc': '腰椎融合器 12×22mm',
                              'name': '脊柱内固定器 融合器',
                              'id': 810000000425
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '62311226',
                              'desc': '腰椎融合器 12×26mm',
                              'name': '脊柱内固定器 融合器',
                              'id': 810000000426
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '62311230',
                              'desc': '腰椎融合器 12×30mm',
                              'name': '脊柱内固定器 融合器',
                              'id': 810000000427
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '62311234',
                              'desc': '腰椎融合器 12×34mm',
                              'name': '脊柱内固定器 融合器',
                              'id': 810000000428
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '62311422',
                              'desc': '腰椎融合器 14×22mm',
                              'name': '脊柱内固定器 融合器',
                              'id': 810000000429
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '62311426',
                              'desc': '腰椎融合器 14×26mm',
                              'name': '脊柱内固定器 融合器',
                              'id': 810000000430
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '62311430',
                              'desc': '腰椎融合器 14×30mm',
                              'name': '脊柱内固定器 融合器',
                              'id': 810000000431
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '62311434',
                              'desc': '腰椎融合器 14×34mm',
                              'name': '脊柱内固定器 融合器',
                              'id': 810000000432
                          }
                      ],
                      'isFullAuth': true,
                      'path': [
                          {
                              'children': [],
                              'name': '浙江省',
                              'id': 1001
                          }
                      ],
                      'id': 810000000123,
                      'name': '腰椎融合器'
                  }
              ],
              'isFullAuth': true,
              'path': [
                  {
                      'children': [],
                      'name': '浙江省',
                      'id': 1001
                  }
              ],
              'id': 810000000054,
              'name': '融合器'
          }
      ],
      'goods': []
  },
  {
      'isFullAuth': true,
      'id': 810000000020,
      'name': 'RLIP',
      'path': [
          {
              'children': [],
              'name': '浙江省',
              'id': 1001
          }
      ],
      'children': [
          {
              'children': [
                  {
                      'goods': [
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61795500',
                              'desc': '棒',
                              'name': '脊柱内固定器 钉棒系统 棒',
                              'id': 810000000415
                          }
                      ],
                      'isFullAuth': true,
                      'path': [
                          {
                              'children': [],
                              'name': '浙江省',
                              'id': 1001
                          }
                      ],
                      'id': 810000000124,
                      'name': '棒'
                  }
              ],
              'isFullAuth': true,
              'path': [
                  {
                      'children': [],
                      'name': '浙江省',
                      'id': 1001
                  }
              ],
              'id': 810000000055,
              'name': '棒'
          },
          {
              'children': [
                  {
                      'goods': [
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61792530',
                              'desc': '固定复位螺钉 5.5×30mm',
                              'name': '脊柱内固定器 钉棒系统 固定复位螺钉',
                              'id': 810000000400
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61792535',
                              'desc': '固定复位螺钉 5.5×35mm',
                              'name': '脊柱内固定器 钉棒系统 固定复位螺钉',
                              'id': 810000000401
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61792540',
                              'desc': '固定复位螺钉 5.5×40mm ',
                              'name': '脊柱内固定器 钉棒系统 固定复位螺钉',
                              'id': 810000000402
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61792545',
                              'desc': '固定复位螺钉 5.5×45mm ',
                              'name': '脊柱内固定器 钉棒系统 固定复位螺钉',
                              'id': 810000000403
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61792550',
                              'desc': '固定复位螺钉 5.5×50mm',
                              'name': '脊柱内固定器 钉棒系统 固定复位螺钉',
                              'id': 810000000404
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61792735',
                              'desc': '固定复位螺钉 6.5×35mm',
                              'name': '脊柱内固定器 钉棒系统 固定复位螺钉',
                              'id': 810000000405
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61792740',
                              'desc': '固定复位螺钉 6.5×40mm ',
                              'name': '脊柱内固定器 钉棒系统 固定复位螺钉',
                              'id': 810000000406
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61792745',
                              'desc': '固定复位螺钉 6.5×45mm ',
                              'name': '脊柱内固定器 钉棒系统 固定复位螺钉',
                              'id': 810000000407
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61792750',
                              'desc': '固定复位螺钉 6.5×50mm ',
                              'name': '脊柱内固定器 钉棒系统 固定复位螺钉',
                              'id': 810000000408
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61792755',
                              'desc': '固定复位螺钉 6.5×55mm',
                              'name': '脊柱内固定器 钉棒系统 固定复位螺钉',
                              'id': 810000000409
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61792825',
                              'desc': '固定复位螺钉 7.0×25mm',
                              'name': '脊柱内固定器 钉棒系统 固定复位螺钉',
                              'id': 810000000410
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61792830',
                              'desc': '固定复位螺钉 7.0×30mm ',
                              'name': '脊柱内固定器 钉棒系统 固定复位螺钉',
                              'id': 810000000411
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61792835',
                              'desc': '固定复位螺钉 7.0×35mm ',
                              'name': '脊柱内固定器 钉棒系统 固定复位螺钉',
                              'id': 810000000412
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61792840',
                              'desc': '固定复位螺钉 7.0×40mm',
                              'name': '脊柱内固定器 钉棒系统 固定复位螺钉',
                              'id': 810000000413
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61792845',
                              'desc': '固定复位螺钉 7.0×45mm',
                              'name': '脊柱内固定器 钉棒系统 固定复位螺钉',
                              'id': 810000000414
                          }
                      ],
                      'isFullAuth': true,
                      'path': [
                          {
                              'children': [],
                              'name': '浙江省',
                              'id': 1001
                          }
                      ],
                      'id': 810000000125,
                      'name': '固定角度复位螺钉'
                  },
                  {
                      'isFullAuth': true,
                      'goods': [
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61791535',
                              'desc': '万向复位螺钉 5.5×35mm',
                              'name': '脊柱内固定器 钉棒系统 万向复位螺钉',
                              'id': 810000000392
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61791540',
                              'desc': '万向复位螺钉 5.5×40mm ',
                              'name': '脊柱内固定器 钉棒系统 万向复位螺钉',
                              'id': 810000000393
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61791545',
                              'desc': '万向复位螺钉 5.5×45mm ',
                              'name': '脊柱内固定器 钉棒系统 万向复位螺钉',
                              'id': 810000000394
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61791550',
                              'desc': '万向复位螺钉 5.5×50mm',
                              'name': '脊柱内固定器 钉棒系统 万向复位螺钉',
                              'id': 810000000395
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61791735',
                              'desc': '万向复位螺钉 6.5×35mm',
                              'name': '脊柱内固定器 钉棒系统 万向复位螺钉',
                              'id': 810000000396
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61791740',
                              'desc': '万向复位螺钉 6.5×40mm ',
                              'name': '脊柱内固定器 钉棒系统 万向复位螺钉',
                              'id': 810000000397
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61791745',
                              'desc': '万向复位螺钉 6.5×45mm ',
                              'name': '脊柱内固定器 钉棒系统 万向复位螺钉',
                              'id': 810000000398
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61791750',
                              'desc': '万向复位螺钉 6.5×50mm ',
                              'name': '脊柱内固定器 钉棒系统 万向复位螺钉',
                              'id': 810000000399
                          }
                      ],
                      'path': [
                          {
                              'children': [],
                              'name': '浙江省',
                              'id': 1001
                          }
                      ],
                      'id': 810000000126,
                      'name': '万向复位螺钉'
                  }
              ],
              'isFullAuth': true,
              'path': [
                  {
                      'children': [],
                      'name': '浙江省',
                      'id': 1001
                  }
              ],
              'id': 810000000056,
              'name': '螺钉'
          },
          {
              'children': [
                  {
                      'goods': [
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61772001',
                              'desc': '螺塞',
                              'name': '脊柱内固定器 钉棒系统 螺塞',
                              'id': 810000000364
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61790001',
                              'desc': '顶丝',
                              'name': '脊柱内固定器 钉棒系统 螺塞',
                              'id': 810000000416
                          }
                      ],
                      'isFullAuth': true,
                      'path': [
                          {
                              'children': [],
                              'name': '浙江省',
                              'id': 1001
                          }
                      ],
                      'id': 810000000127,
                      'name': '螺塞'
                  }
              ],
              'isFullAuth': true,
              'path': [
                  {
                      'children': [],
                      'name': '浙江省',
                      'id': 1001
                  }
              ],
              'id': 810000000057,
              'name': '螺塞'
          },
          {
              'children': [
                  {
                      'goods': [
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61790201',
                              'desc': '前路垫片 小',
                              'name': '脊柱内固定器 钉棒系统 垫片',
                              'id': 810000000579
                          }
                      ],
                      'isFullAuth': true,
                      'path': [
                          {
                              'children': [],
                              'name': '浙江省',
                              'id': 1001
                          }
                      ],
                      'id': 810000000161,
                      'name': '单棒垫片'
                  },
                  {
                      'isFullAuth': true,
                      'goods': [
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61790202',
                              'desc': '前路垫片 中',
                              'name': '脊柱内固定器 钉棒系统 垫片',
                              'id': 810000000580
                          }
                      ],
                      'path': [
                          {
                              'children': [],
                              'name': '浙江省',
                              'id': 1001
                          }
                      ],
                      'id': 810000000162,
                      'name': '单棒垫片'
                  },
                  {
                      'isFullAuth': true,
                      'goods': [
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61790203',
                              'desc': '前路垫片 大',
                              'name': '脊柱内固定器 钉棒系统 垫片',
                              'id': 810000000581
                          }
                      ],
                      'path': [
                          {
                              'children': [],
                              'name': '浙江省',
                              'id': 1001
                          }
                      ],
                      'id': 810000000163,
                      'name': '单棒垫片'
                  }
              ],
              'isFullAuth': true,
              'path': [
                  {
                      'children': [],
                      'name': '浙江省',
                      'id': 1001
                  }
              ],
              'id': 810000000159,
              'name': '前路垫片'
          },
          {
              'children': [
                  {
                      'goods': [
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61790101',
                              'desc': '可调横连',
                              'name': '脊柱内固定器 钉棒系统 横连',
                              'id': 810000000582
                          }
                      ],
                      'isFullAuth': true,
                      'path': [
                          {
                              'children': [],
                              'name': '浙江省',
                              'id': 1001
                          }
                      ],
                      'id': 810000000164,
                      'name': '可调横连'
                  }
              ],
              'isFullAuth': true,
              'path': [
                  {
                      'children': [],
                      'name': '浙江省',
                      'id': 1001
                  }
              ],
              'id': 810000000160,
              'name': '横连'
          }
      ],
      'goods': []
  },
  {
      'isFullAuth': true,
      'id': 810000000021,
      'name': 'ROSE',
      'path': [
          {
              'children': [],
              'name': '浙江省',
              'id': 1001
          }
      ],
      'children': [
          {
              'children': [
                  {
                      'goods': [
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61771500',
                              'desc': '棒 5.5×500',
                              'name': '脊柱内固定器 钉棒系统 棒',
                              'id': 810000000363
                          }
                      ],
                      'isFullAuth': true,
                      'path': [
                          {
                              'children': [],
                              'name': '浙江省',
                              'id': 1001
                          }
                      ],
                      'id': 810000000128,
                      'name': '5.5棒'
                  }
              ],
              'isFullAuth': true,
              'path': [
                  {
                      'children': [],
                      'name': '浙江省',
                      'id': 1001
                  }
              ],
              'id': 810000000058,
              'name': '棒'
          },
          {
              'children': [
                  {
                      'goods': [
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61770010',
                              'desc': '5.5连接头 10mm',
                              'name': '脊柱内固定器 钉棒系统 连接器',
                              'id': 810000000347
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61770020',
                              'desc': '5.5连接头 20mm',
                              'name': '脊柱内固定器 钉棒系统 连接器',
                              'id': 810000000348
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61770030',
                              'desc': '5.5连接头 30mm',
                              'name': '脊柱内固定器 钉棒系统 连接器',
                              'id': 810000000349
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61770060',
                              'desc': '5.5连接头 60mm',
                              'name': '脊柱内固定器 钉棒系统 连接器',
                              'id': 810000000350
                          }
                      ],
                      'isFullAuth': true,
                      'path': [
                          {
                              'children': [],
                              'name': '浙江省',
                              'id': 1001
                          }
                      ],
                      'id': 810000000129,
                      'name': '配合5.5棒'
                  }
              ],
              'isFullAuth': true,
              'path': [
                  {
                      'children': [],
                      'name': '浙江省',
                      'id': 1001
                  }
              ],
              'id': 810000000059,
              'name': '连接头'
          },
          {
              'children': [
                  {
                      'goods': [
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61770540',
                              'desc': '闭口万向螺钉 5.5×40',
                              'name': '脊柱内固定器 钉棒系统 万向螺钉',
                              'id': 810000000351
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61770550',
                              'desc': '闭口万向螺钉 5.5×50',
                              'name': '脊柱内固定器 钉棒系统 万向螺钉',
                              'id': 810000000352
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61770560',
                              'desc': '闭口万向螺钉 5.5×60',
                              'name': '脊柱内固定器 钉棒系统 万向螺钉',
                              'id': 810000000353
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61770650',
                              'desc': '闭口万向螺钉 6.5×50',
                              'name': '脊柱内固定器 钉棒系统 万向螺钉',
                              'id': 810000000354
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61770660',
                              'desc': '闭口万向螺钉 6.5×60',
                              'name': '脊柱内固定器 钉棒系统 万向螺钉',
                              'id': 810000000355
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61770670',
                              'desc': '闭口万向螺钉 6.5×70',
                              'name': '脊柱内固定器 钉棒系统 万向螺钉',
                              'id': 810000000356
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61770760',
                              'desc': '闭口万向螺钉 7.5×60',
                              'name': '脊柱内固定器 钉棒系统 万向螺钉',
                              'id': 810000000357
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61770770',
                              'desc': '闭口万向螺钉 7.5×70',
                              'name': '脊柱内固定器 钉棒系统 万向螺钉',
                              'id': 810000000358
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61770780',
                              'desc': '闭口万向螺钉 7.5×80',
                              'name': '脊柱内固定器 钉棒系统 万向螺钉',
                              'id': 810000000359
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61770870',
                              'desc': '闭口万向螺钉 8.5×70',
                              'name': '脊柱内固定器 钉棒系统 万向螺钉',
                              'id': 810000000360
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61770880',
                              'desc': '闭口万向螺钉 8.5×80',
                              'name': '脊柱内固定器 钉棒系统 万向螺钉',
                              'id': 810000000361
                          },
                          {
                              'path': [
                                  {
                                      'children': [],
                                      'name': '浙江省',
                                      'id': 1001
                                  }
                              ],
                              'no': '61770890',
                              'desc': '闭口万向螺钉 8.5×90',
                              'name': '脊柱内固定器 钉棒系统 万向螺钉',
                              'id': 810000000362
                          }
                      ],
                      'isFullAuth': true,
                      'path': [
                          {
                              'children': [],
                              'name': '浙江省',
                              'id': 1001
                          }
                      ],
                      'id': 810000000130,
                      'name': '闭口万向螺钉'
                  }
              ],
              'isFullAuth': true,
              'path': [
                  {
                      'children': [],
                      'name': '浙江省',
                      'id': 1001
                  }
              ],
              'id': 810000000060,
              'name': '螺钉'
          },
          {
              'children': [
                  {
                      'isFullAuth': true,
                      'path': [
                          {
                              'children': [],
                              'name': '浙江省',
                              'id': 1001
                          }
                      ],
                      'id': 810000000131,
                      'name': '螺塞'
                  }
              ],
              'isFullAuth': true,
              'path': [
                  {
                      'children': [],
                      'name': '浙江省',
                      'id': 1001
                  }
              ],
              'id': 810000000061,
              'name': '螺塞'
          }
      ],
      'goods': []
  }
];

let result = [];

const test = (arr, flag = true) => {
  console.log('---------------');
  arr.forEach(v => console.log(_.pick(v, ['id', 'name', 'parent']) ) );
  console.log(flag);
  arr.forEach(v => {
    if (flag) v.parent = 0;
    result.push(_.pick(v, ['id', 'name', 'parent']));
    if (v.children && v.children.length > 0) {
      v.children.forEach(r => r.parent = v.id);
      return test(v.children, false);
    }
  }); 
};

test(arr);


console.log('-------------end');

console.log(result);